const qnaList = [
    {
        q: '1. 이성 사이에 진정한 친구는 있다, 없다?',
        a: [
            {answer: 'a. 이성 사이에 친구가 어딨어? 절대 없어', type: ['cow', 'tiger', 'dragon', 'chick']},
            {answer: 'b. 친구 있지, 절대 이성으로만 안 보일 뿐', type : ['mouse', 'rabbit','horse','snake','dog','monkey']},
            {answer: 'c. 난 잘 모르겠어 .. ', type: ['sheep', 'pig']},

        ]
    },

    {
        q: '2. 좋아하는 사람이 생겨 연락하고자 한다' ,
        a: [
            {answer: 'a. 바로 먼저 연락한다.', type: ['mouse','rabbit','tiger','monkey']},
            {answer: 'b. 언제 연락할지, 어떻게 말할지 심사숙고하여 연락한다.', type: ['cow','horse','snake','dog']},
            {answer: 'c. 상대방에게 먼저 연락 올 때까지 기다린다.', type: ['sheep', 'dragon','chick','pig']},
        ]
    },

    {
        q: '3. 당신의 고백 스타일은?',

    },

    {
        q: '4. 호감가는 고백 멘트를 고른다면?',
    },

    {
        q: '5. 오늘 연인과 첫 데이트 하는 날이다. 첫 날 허용할 수 있는 스킨십의 범위는? ',

    },

    {
        q: '6. 기념일이 다가온다. 당신은 어떻게 할 것인가? (ex- 100일 , 200일) ',
    },

    {
        q: '7. 연인이 오늘 머리를 바꾸고 옷도 새로 샀다.',
    },
    
    {
        q: '8. 연인이 데이트가 끝난 후, 집에 데려다 달라고 한다.',
    },

    {
        q: '9. 연인에게 하루종일 연락이 안온다..',
        a: [
            
            {answer: 'a. 뭐.. 언젠가 연락 오겠지. 내가 할 일 하며 기다린다.', type: ['sheep','mouse','snake','chick']},
            {answer: 'b. 초조해서 마음 졸이며 인스타, 페이스북, 카카오톡 등 모든 SNS를 다 들어가본다.', type: ['cow','rabbit','horse','pig']},
            {answer: 'c. 연인에게 연락 올 때까지 무한 카톡, 무한 전화를 한다.', type: ['tiger','dog','monkey','dragon']},
        ]
    },

    {
        q: '10. 연인이 연락도 없이 보고싶다고 우리집 앞에 와서 기다린다',
    },
    {
        q: '11. 내가 추구하는 연애관은? ',
    },
    {
        q: '12. 연인과 데이트 도중 화를 참을 수 없을만큼 심하게 싸웠다. 어떻게 할 것인가? ',
    },

]

const infoList = [
    {
        name: '연애 뭐 식은 죽 먹기죠, 연애 재능 만땅 <쥐>',
        desc: '연애의 프로재능러인 당신! 쥐에 해당하는 당신은 연애의 모든 것들을 알고 있어, 쉽게 연애에 성공하는 스타일입니다. 주로 포부가 크고 성격이 낙천적이며 논리적이고 두뇌회전이 매우 빠르다고 할 수 있어요. 말 재주 또한 좋아 사교성이 좋고 유쾌하지만 화려한 것을 좋아해 허영심을 부리거나 사치를 부리는 점은 주의해야 합니다. 뛰어난 능력에 자만하는 경우가 종종 있기 때문에 겸손이 필요합니다!'
    },

]